### DataFrame에서 원소/요소 데이터 변경

In [1]:
import pandas as pd

In [14]:
# 데이터 준비
data = {'name':['홍길동','마징가','원더우먼'],
        'job':['의적','로봇','영어'],
        'gender':['남','남','여'],
        'age':[100,200,300],
        'height':[180,300,200]}

In [15]:
dataDF = pd.DataFrame(data)

In [16]:
dataDF

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영어      여  300     200

- [원소/요소 값 변경]

In [18]:
## 홍길동의 성별을 '남자' --> '여자'
## 현재 홍길동의 성별 정보 추출
dataDF.iloc[0]['gender']

'남'

In [19]:
dataDF.iloc[0,2]

'남'

In [20]:
## '남' ==> '여' 변경
dataDF.iloc[0,2] = '여'

In [21]:
dataDF

   name job gender  age  height
0   홍길동  의적      여  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영어      여  300     200

In [24]:
## 원더우먼 직업을 직장인으로 변경
dataDF.iloc[2,1] = '직장인'

In [25]:
dataDF

   name  job gender  age  height
0   홍길동   의적      여  100     180
1   마징가   로봇      남  200     300
2  원더우먼  직장인      여  300     200

- [행 전체 값 변경]

In [26]:
# 행 전체 선택 => 변수명.iloc[]/ 변수명.loc[]
dataDF.iloc[1]

name      마징가
job        로봇
gender      남
age       200
height    300
Name: 1, dtype: object

In [30]:
# 1번 행 값 변경 == 데이터 개수
dataDF.iloc[1] =['마징가2','영웅','여자',90,None]

In [31]:
dataDF

   name  job gender  age  height
0   홍길동   의적      여  100   180.0
1  마징가2   영웅     여자   90     NaN
2  원더우먼  직장인      여  300   200.0

In [33]:
# 1번 행 값 변경=>  1개== 데이터 개수
dataDF.iloc[1] =0
dataDF

   name  job gender  age  height
0   홍길동   의적      여  100   180.0
1     0    0      0    0     0.0
2  원더우먼  직장인      여  300   200.0

In [35]:
dataDF.iloc[1] ={'name':'마이트','job':'수리공'}
dataDF

   name  job gender    age  height
0   홍길동   의적      여  100.0   180.0
1   마이트  수리공    NaN    NaN     NaN
2  원더우먼  직장인      여  300.0   200.0

In [36]:
dataDF.height = 0
dataDF

   name  job gender    age  height
0   홍길동   의적      여  100.0       0
1   마이트  수리공    NaN    NaN       0
2  원더우먼  직장인      여  300.0       0